Flashcard-App/app/controllers/cards_controller.rb

SELECT  "cards".* FROM "cards" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @cards = Card.all