Flashcard-App/app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks"
---
  def index
    @decks = Deck.all

SELECT "decks".* FROM "decks" LEFT OUTER JOIN "cards" ON "cards"."deck_id" = "decks"."id" WHERE "cards"."deck_id" = $1  [["deck_id", 10]]
---
  def show
    @deck_with_cards = Deck.joins(:cards).where(cards:{deck_id: @deck}).select('*').all

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_deck
      @deck = Deck.find(params[:id])