Flashcard-App/app/controllers/questions_controller.rb

INSERT INTO "questions" ("q_value", "a_value", "created_at", "updated_at", "quiz_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["q_value", "123"], ["a_value", "123"], ["created_at", "2018-06-01 20:24:19.193924"], ["updated_at", "2018-06-01 20:24:19.193924"], ["quiz_id", 1]]
---
  def create
    @question = Question.new(question_params)
    if @question.save